{
  "basics": {
    "name": "👨🏼‍💻 Andrei Terecoasa",
    "label": "Passionated Senior Software Development Engineer | FullStack JS, ML/Ops, Python",
    "image": "",
    "email": "terecoasa.andrei@gmail.com",
    "phone": "0729695506",
    "url": "https://tere.ro",
    "summary": "With over seven years of experience in production-ready environments, I have honed my skills in building robust, scalable, and efficient applications.\n\nIn recent years, I have taken on new challenges in the fields of Data Science, Machine Learning, and Content Intelligence.",
    "location": {
      "countryCode": "RO",
      "address": "Bucharest, Romania"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "andrei-terecoasa",
        "url": "https://www.linkedin.com/in/andrei-terecoasa/"
      },
      {
        "network": "Twitter",
        "username": "AndreiTerecoasa",
        "url": "https://twitter.com/AndreiTerecoasa"
      }
    ]
  },
  "work": [
    {
      "name": "IBM",
      "position": "Senior Software Development Engineer",
      "startDate": "2020-03-31",
      "highlights": [
        "ML/Ops Project Development in Finance using Python\n - Re-design and refactoring of an ML project inferring skill levels based on unstructured data\n - Developed new features to enhance the project's functionality.\n - Deployed CI/CD pipelines (Tekton/OpenShift) to improve project efficiency.\n\nContent Intelligence Platform \n - Designed and developed multiple Python-based plug-n-play microservices utilized in an orchestration pipeline for efficient document processing.\n - Implemented a robust CI/CD strategy in OpenShift environments, leveraging tools such as Tekton Pipelines\n - Maintained a deep understanding of the latest technologies and trends in the field to ensure optimal performance and functionality.\"\n\n\nData Science Project on AWS\n - migrating from KEDRO pipelines to AWS services, enabling more efficient data processing and analysis.\n - Conducting feature engineering refactoring using Python and PySpark, targeting improved accuracy and performance"
      ],
      "summary": "Experienced Software Engineer adept at architecting and building applications that seamlessly integrate ML, MLOps, Front-End, and Back-End technologies. Proficient in Python and JavaScript, I excel in creating solutions that encompass a wide range of tech disciplines.",
      "url": "https://www.linkedin.com/company/1009",
      "location": "Bucureşti, România"
    },
    {
      "name": "IBM",
      "position": "Lead Full Stack Engineer",
      "startDate": "2020-03-31",
      "endDate": "2021-03-31",
      "highlights": [
        "UI Library and Data Science Dashboard Development for the Oil Industry",
        "Designed and developed data science dashboards for the oil industry using ReactJS, VueJS, NodeJS, Python, and Azure",
        "Created a reusable UI component library to improve development efficiency",
        "Implemented effective architecture for data visualization and analysis"
      ],
      "summary": "As a senior JavaScript developer, I expanded my expertise into Python while designing and developing advanced data science dashboards for the oil industry. This involved using ReactJS, VueJS, NodeJS, and Azure.",
      "url": "https://www.linkedin.com/company/1009",
      "location": "Bucureşti, România"
    },
    {
      "name": "IBM",
      "position": "Full Stack Developer",
      "startDate": "2017-08-31",
      "endDate": "2020-03-31",
      "highlights": [
        "Global Chat Bot Project\n\n - Architecture / Design / Implementation for a Siemens AG on a a one-of-a-kind AI-based virtual agent \n - that innovates employee support (public reference)\n - Lead the team migrating from AngularJS to VueJS\n - Vue, AngularJS, NodeJS, MongoDB, IBM Cloud\n - Integration Testing\n\nhttps://www.ibm.com/case-studies/siemens-ag-watson-ai"
      ],
      "summary": "Collaborated in a team to develop a distinctive ChatBot aimed at assisting employees with HR-related issues, as part of the Global Chat Bot Project for Siemens AG.",
      "url": "https://www.linkedin.com/company/1009",
      "location": "Bucharest, Romania"
    },
    {
      "name": "Luxoft",
      "position": "Javascript Developer",
      "startDate": "2016-07-31",
      "endDate": "2017-08-31",
      "highlights": [
        "I joined their efforts to internationalize a networking device management application comprised of many smaller parts written in various programming languages or frameworks. From pure Javascript to jQuery, AngularJS, or Java we had to parse, extract and adapt our i18n strategy to make our product available in multiple languages.\n\nWhile the internationalization task itself was very challenging, the thing I was super proud about was a tool I built via an extension to the SublimeText editor, which will have helped the team easily extract the strings, replace them with library-specific calls for the i18n and then save the matches into the database. With the help of some API written in NodeJS and also some scheduled jobs to easily translate the strings, we saved a great deal of time which we invested in testing and refinements."
      ],
      "summary": "Joined a team to internationalize a multifaceted networking device management application, handling a variety of programming languages and frameworks from JavaScript, jQuery, AngularJS, to Java.",
      "url": "https://www.linkedin.com/company/5300",
      "location": "București, România"
    },
    {
      "name": "NXP Semiconductors",
      "position": "Software Engineer Intern",
      "startDate": "2015-07-31",
      "endDate": "2016-06-30",
      "highlights": [
        "I joined NXP while still being a student and this was the first big step in my career providing me the best place to harden my existing frontend skills and also develop new ones.\n\nStarted with small UI fixes in the Bootstrap+jQuery environment for an internal system on the Q&A department I ended up refactoring/upgrading almost fully the frontend to the latest libraries versions and also developing new features in the PHP backend. Besides this I also co-owned the setup for the deplyoment environment (switched from a windows to a linux machine)."
      ],
      "summary": "Starting as a student, I initially focused on modest UI fixes but gradually progressed to successfully deliver a thoroughly refactored frontend and an improved backend.",
      "url": "https://www.linkedin.com/company/1088",
      "location": "Bucharest, Romania"
    }
  ],
  "volunteer": [
    {
      "organization": "Electronics Students League (LSE)",
      "position": "Technical Coordinator",
      "startDate": "2012-09-30",
      "endDate": "2017-09-30",
      "summary": "My passion for technology and programming brought me the honor to be a part of this amazing organization. \n\nAt first, I was helping with maintaining the existing websites built for the various projects LSE was organizing. From time to time, also got the change to really code new functionalities required for some websites. This was the first time I got to built WordPress extensions with PHP, of course.\n\nSoon enough, as the Technical Coordinator, I was in charge of managing the whole VPS where all the websites were hosted and also trying to lead a small team of volunteers in digitalization efforts.  \n\nAs for the technical part of it, this was challenging and interesting as  I was able to deepen my knowledge about hosting, domains, VPS managing, databases (mostly MySQL), and also PHP. \n\nAs for the leadership part, this was my first experience in this matter which, of course, proved to be challenging. Probably the most difficult part was to convince the volunteers about the non-monetary benefits such an experience could prove in the long term.",
      "highlights": [],
      "url": "https://www.linkedin.com/company/2000307"
    },
    {
      "organization": "TEDxUniversitateaPolitehnicaBucurești",
      "position": "ITManager",
      "startDate": "2017-01-31",
      "endDate": "2018-07-31",
      "summary": "Misiunea noastră se concentrează asupra generării unui flux inedit de idei și atitudini prin prisma cărora membrii comunității din care facem parte pot determina impulsuri ale schimbării care să se propage sub forma unei evoluții sustenabile însoțite de un impact favorabil și durabil asupra societății. Astfel se conturează și obiectivul principal care ne marchează misiunea: formarea de inițiatori care să perpetueze esența conceptelor pe care noi le descoperim, utilizăm și promovăm.\n\nPrin evenimentele pe care le organizăm ne propunem să lansăm spectatorilor noștri provocări aflate în strânsă legătură cu problemele actuale ale societății și urmărim să-i transpunem din poziția de spectatori în actanți remarcabili în rezolvarea acestora. Ideile personale, motivația și experiențele invitaților noștri vor constitui bazele acestei călătorii pe teritoriul multiperspectivismului și al noilor orizonturi.\n\nhttps://tedxuniversitateapolitehnicabucuresti.com",
      "highlights": [],
      "url": "https://www.linkedin.com/company/18212110"
    }
  ],
  "education": [
    {
      "institution": "Facultatea de Electronica, Telecomunicatii si Tehnologia informatiei",
      "area": "Inginerie electronică şi telecomunicaţii",
      "studyType": "Master's degree",
      "startDate": "2016-01-01",
      "endDate": "2018-12-31",
      "courses": []
    },
    {
      "institution": "Facultatea de Electronica, Telecomunicatii si Tehnologia informatiei",
      "area": "Inginerie electronică şi telecomunicaţii",
      "studyType": "Bachelor's degree",
      "startDate": "2012-12-31",
      "endDate": "2016-12-31",
      "score": "",
      "courses": [
        " - Programarea Calculatoarelor (C)",
        " - Programare Obiect - Orientata (JAVA)",
        " - Dezvoltarea Aplicatiilor Android Inovative"
      ]
    },
    {
      "institution": "Colegiul \"Mihail Cantacuzino\", Sinaia",
      "area": "Matematică - Informatică Intensiv Informatică",
      "studyType": "Bacalaureat",
      "startDate": "2008-12-31",
      "endDate": "2012-12-31",
      "score": "8,60",
      "courses": []
    }
  ],
  "awards": [],
  "certificates": [
    {
      "name": "Award of Course Completion – Database Design and programming With SQL ",
      "issuer": "Oracle Academy",
      "startDate": "2011-11-30"
    },
    {
      "name": "Bluemix Essentials",
      "issuer": "IBM",
      "startDate": "2018-04-30",
      "url": "https://www.youracclaim.com/badges/28ecc0c4-0145-45b3-bf68-3949fcbafbf7/linked_in_profile"
    },
    {
      "name": "Cognitive Practitioner",
      "issuer": "IBM",
      "startDate": "2018-05-31",
      "url": "https://www.youracclaim.com/badges/63e719f7-a056-48d7-952d-9aeff1ac7300/linked_in_profile"
    },
    {
      "name": "Watson Discovery Service for Developers",
      "issuer": "IBM",
      "endDate": "2019-07-31",
      "startDate": "2018-07-31",
      "url": "https://www.youracclaim.com/badges/3098659a-cc3c-4cd5-89d0-001b0b2a7ea9/linked_in_profile"
    },
    {
      "name": "Build Chatbots with Watson Conversation",
      "issuer": "IBM",
      "startDate": "2018-07-31",
      "url": "https://www.youracclaim.com/badges/a74eb6b8-072c-4135-9f8c-ce6759e3e066/linked_in_profile"
    },
    {
      "name": "Getting Started with Containers on IBM Cloud",
      "issuer": "IBM",
      "startDate": "2018-12-31",
      "url": "https://www.youracclaim.com/badges/bc2d13c6-ba86-4a98-93b4-6ac7d9202210/linked_in_profile"
    },
    {
      "name": "Industrial Products Industry Foundations",
      "issuer": "IBM",
      "startDate": "2018-12-31",
      "url": "https://www.youracclaim.com/badges/5a0f067a-f257-46e7-ab1a-e413709a7598/linked_in_profile"
    }
  ],
  "publications": [],
  "skills": [
    {
      "name": "PostgreSQL",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "MySQL",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "English",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Database Management System (DBMS)",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "JIRA",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "OpenShift",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Linux",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Vite",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Vuetify",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "REST APIs",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Node.js",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Vue.js",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Python",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "CI/CD",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "JavaScript",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Amazon Web Services (AWS)",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Solution Architecture",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "SQL",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Flutter",
      "level": "Senior",
      "keywords": []
    },
    {
      "name": "Kubernetes",
      "level": "Senior",
      "keywords": []
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native Speaker"
    },
    {
      "fluency": "Full Professional",
      "language": "Engleză"
    },
    {
      "fluency": "Elementary",
      "language": "Franceză"
    }
  ],
  "interests": [],
  "references": [
    {
      "name": "Lucian Gruia",
      "reference": "Andrei is a total example of commitment, availability and loyalty. He followed me as the technical leader of the IT Department and MobilPRO in our student organisation and successfully developed the team and consolidated all the organisation’s projects from a technical point of view.\n\nHe is one of the best developers I know and he is widely recognized by multiple generations of ETTI students as a model for his technical skills. \n\nEven after I handed the department over to him, we continued to work so well together, that we are collaborating on a daily basis even to this day. Andrei has been actively involved as a reliable developer in most projects of TC (including Questo, Cuibul Artistilor, TEDxUPB) and since 2021 we started to work together on a revolutionary mobile app, having him as a lead front-end developer.",
      "url": "https://www.linkedin.com/in/andrei-terecoasa/"
    },
    {
      "name": "Cristian Buta",
      "reference": "Andrei and I worked togheter on the same project, proving to be a real asset to our team, and showing a great capacity of delivering solutions efficiently on time. He is quite a unique fullstack developer, being very adaptable in working with multiple technologies and programming languages and impressing with his capacity of learning and implementing in a very short amount of time.\n\nI recommend Andrei to any team for his hands on development skills.\n\n\n",
      "url": "https://www.linkedin.com/in/andrei-terecoasa/"
    }
  ],
  "projects": [
    {
      "name": "Questo Mobile App",
      "external": true,
      "startDate": "2015-01-01",
      "endDate": "2018-12-31",
      "summary": "Full Stack Developer | JavaScript",
      "url": "https://luciangruia.ro/projects/questo-app-tc/"
    },
    {
      "name": "Cuibul Artistilor",
      "external": true,
      "active": true,
      "startDate": "2015-01-01",
      "endDate": "",
      "summary": "Full Stack Developer | JavaScript",
      "url": "https://luciangruia.ro/projects/cuibul-artistilor-tc/"
    },
    {
      "name": "Ionadi",
      "external": true,
      "startDate": "2015-01-01",
      "endDate": "",
      "summary": "Frontend Developer",
      "url": "https://luciangruia.ro/projects/ionadi-tc/"
    }
  ]
}